Infineon/SBC-for-Arduino/LiteSBC Microcontroller Library/com.ifx.tb.legacy.configwizard_2.1.30.201902131318/application/scripts/ICW_TLE9263/TLE9263.svd
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!--Version of used XSLT processor: 2.0 Altova GmbH http://www.altova.com-->
<!--Version of used XSLT: ISFR2SVD.xslt  V0.10-->
<!--Configuration of XSLT: with bit extraction =Yes;  with bit coding =Yes; decodeThe3knownBitAccessTypes = Yes; 0,r and 1,r bit extraction = No-->
<!--Version of used XSLT for fixing SVD issues: SVD_fixes.xslt  V1.4-->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.0" xs:noNamespaceSchemaLocation="c:\fm8_xml\XSLT\RD2ISFR\CMSIS-SVD_Schema_1_0.xsd">
	<vendor>Infineon</vendor>
	<name>TLE9263</name>
	<version>0.2</version>
	<description>TLE9263 Family</description>
	<addressUnitBits>8</addressUnitBits>
	<width>8</width>
	<peripherals>
		<peripheral>
			<name>CTRL</name>
			<description>Control</description>
			<baseAddress>0x0000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x40</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>M_S_CTRL</name>
					<description>Mode- and Supply Control</description>
					<addressOffset>1</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>MODE</name>
							<description>SBC Mode Control</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Normal</name>
									<description>SBC Normal Mode</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Sleep</name>
									<description>SBC Sleep Mode</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Stop</name>
									<description>SBC Stop Mode</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Soft_Reset</name>
									<description>SBC Reset: Soft Reset is executed (configuration of RSTN triggering in bit SOFT_RESET_RST)</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC3_ON</name>
							<description>VCC3 Mode Control</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VCC3_off</name>
									<description>VCC3 off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VCC3_enabled</name>
									<description>VCC3 is enabled (as independent voltage regulator)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>					
						<field>
							<name>VCC2_ON</name>
							<description>VCC2 Mode Control</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VCC2_off</name>
									<description>VCC2 off</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Normal_Mode</name>
									<description>VCC2 on in Normal Mode</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Normal_and_Stop_Mode</name>
									<description>VCC2 on in Normal and Stop Mode</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VCC2_always_on</name>
									<description>VCC2 always on (except in SBC Init - if not in SBC Development Mode, SBC Restart and Fail-Safe Mode)</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC1_OV_RST</name>
							<description>VCC1 Over Voltage leading to Restart / Fail-Safe Mode enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>off</name>
									<description>VCC1_ OV is set in case of VCC1_OV; no SBC Restart or Fail-Safe is entered for VCC1_OV</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>activated</name>
									<description>VCC1_ OV is set in case of VCC1_OV; depending on the device configuration SBC Restart or SBC Fail-Safe Mode is entered (see );</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC1_RT</name>
							<description>VCC1 Reset Threshold Control</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Vrt1</name>
									<description>Vrt1 selected (highest threshold)</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Vrt2</name>
									<description>Vrt2 selected</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Vrt3</name>
									<description>Vrt3 selected</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Vrt4</name>
									<description>Vrt4 selected</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HW_CTRL</name>
					<description>Hardware Control 0</description>
					<addressOffset>2</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>VCC3_V_CFG</name>
							<description>VCC3 Output Voltage Configuration (if configured as independent voltage regulator)</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VCC3_is_same_as_VCC1</name>
									<description>VCC3 has same output voltage as VCC1</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3.3V_or_1.8V</name>
									<description>VCC3 is configured to either 3.3V or 1.8V (depending on VCC1 derivative)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SOFT_RESET_RO</name>
							<description>Soft Reset Configuration</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>RO_triggered_by_Soft_Reset</name>
									<description>RO will be triggered (pulled low) during a Soft Reset</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>not_triggered_by_Soft_Reset</name>
									<description>no RO trigger during a Soft Reset</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FO_ON</name>
							<description>Failure Output Activation</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>off</name>
									<description>FO not activated by software, FO will be activated by specified failures (see ) (0)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>on</name>
									<description>FO activated by software (via SPI), only if configured as FO (1)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC3_VS_UV_OFF</name>
							<description>VCC3 VS_UV shutdown configuration</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VCC3_disabled_at_VS_UV</name>
									<description>VCC3 will be disabled automatically at VS_UV</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VCC3_enable_below_VS_UV</name>
									<description>VCC3 will stay enabled even below VS_UV</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC3_LS</name>
							<description>VCC3 Configuration</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VCC3_as_stanalone_regulator</name>
									<description>VCC3 operating as a stand-alone regulator</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>in_load_sharing_with_VCC1</name>
									<description>VCC3 in load sharing operation with VCC1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC3_LS_STP_ON</name>
							<description>VCC3 Load Sharing in SBC Stop Mode configuration</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VCC3_in_LS_disabled</name>
									<description>VCC3 in LS configuration during SBC Stop Mode and highpower mode: disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VCC3_in_LS_enabled</name>
									<description>VCC3 in LS configuration during SBC Stop Mode and highpower mode: enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CFG</name>
							<description>Configuration Select (see also )</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>after_2nd</name>
									<description>Depending on hardware configuration, SBC Restart or Fail-Safe Mode is reached after the 2. watchdog trigger failure (=default) - Config 3/4</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>after_1st</name>
									<description>Depending on hardware configuration, SBC Restart or Fail-Safe Mode is reached after the 1. watchdog trigger failure - Config 1/2</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WD_CTRL</name>
					<description>Watchdog Control</description>
					<addressOffset>3</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>CHECKSUM</name>
							<description>Watchdog Setting Check Sum Bit</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Counts as 0 for checksum calculation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Counts as 1 for checksum calculation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WD_STM_EN_0</name>
							<description>Watchdog Deactivation during Stop Mode, bit 0 ()</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>active</name>
									<description>Watchdog is active in Stop Mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>off</name>
									<description>Watchdog is deactivated in Stop Mode</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WD_WIN</name>
							<description>Watchdog Type Selection</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Time-out</name>
									<description>Watchdog works as a Time-Out watchdog</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Window</name>
									<description>Watchdog works as a Window watchdog</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WD_EN_WK_BUS</name>
							<description>Watchdog Enable after Bus (CAN) Wake in SBC Stop Mode</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>off</name>
									<description>Watchdog will not start after a CAN wake</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>on</name>
									<description>Watchdog starts with a long open window after CAN Wake</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WD_TIMER</name>
							<description>Watchdog Timer Period</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10ms</name>
									<description>10ms</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>20ms</name>
									<description>20ms</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>50ms</name>
									<description>50ms</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>100ms</name>
									<description>100ms</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>200ms</name>
									<description>200ms</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>500ms</name>
									<description>500ms</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1s</name>
									<description>1000ms</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10s</name>
									<description>10000ms</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUS_CTRL_1</name>
					<description>Bus Control</description>
					<addressOffset>4</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>LIN_FLASH</name>
							<description>LIN Flash Programming Mode</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>slope_control_active</name>
									<description>Slope control mechanism active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>deactive_at_115kBaud</name>
									<description>Deactivation of slope control for baud rates up to 115kBaud</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_LSM</name>
							<description>LIN Low-Slope Mode Selection</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>normal_mode</name>
									<description>LIN Normal-Mode is activated</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>low_slope_mode</name>
									<description>LIN Low-Slope Mode (10.4kBaud) activated</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_TXD_TO</name>
							<description>LIN TXD Time-Out Control</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>TXD_time_out_disabled</name>
									<description>TXD Time-Out feature disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXD_time_out_enabled</name>
									<description>TXD Time-Out feature enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN</name>
							<description>LIN-Module Modes</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>off</name>
									<description>LIN OFF</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>weak_capable</name>
									<description>LIN is wake capable</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>receive_only</name>
									<description>LIN Receive Only Mode</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>normal</name>
									<description>LIN Normal Mode</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAN</name>
							<description>HS-CAN Module Modes (CAN_2 is rw type)</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>off</name>
									<description>CAN OFF</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_capable</name>
									<description>CAN is wake capable (no SWK)</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>receive_only</name>
									<description>CAN Receive Only Mode (no SWK)</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>normal</name>
									<description>CAN Normal Mode (no SWK)</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>off</name>
									<description>CAN OFF</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_capable_(SWK)</name>
									<description>CAN is wake capable with SWK</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>receive_only_(SWK)</name>
									<description>CAN Receive Only Mode with SWK</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>normal_(SWK)</name>
									<description>CAN Normal Mode with SWK</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUS_CTRL_2</name>
					<description>Bus Control</description>
					<addressOffset>5</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>I_PEAK_TH</name>
							<description>VCC1 Active Peak Threshold Selection</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>low_active_threshold</name>
									<description>low VCC1 active peak threshold selected (ICC1,peak_1)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>low_active_threshold</name>
									<description>higher VCC1 active peak threshold selected (ICC1,peak_2)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN2</name>
							<description>LIN2-Module Modes</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>off</name>
									<description>LIN2 OFF</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_capable</name>
									<description>LIN2 is wake capable</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>receive_only</name>
									<description>LIN2 Receive Only Mode</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>normal</name>
									<description>LIN2 Normal Mode</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WK_CTRL_1</name>
					<description>Internal Wake Input Control</description>
					<addressOffset>6</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>TIMER2_WK_EN</name>
							<description>Timer2 Wake Source Control (for cyclic wake)</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>Timer2 wake disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Timer2 is enabled as a wake source</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIMER1_WK_EN</name>
							<description>Timer1 Wake Source Control (for cyclic wake)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>Timer2 wake disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Timer2 is enabled as a wake source</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WD_STM_EN_1</name>
							<description>Watchdog Deactivation during Stop Mode, bit 1 ()</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>WD_active_in_stop_mode</name>
									<description>Watchdog is active in Stop Mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>off</name>
									<description>Watchdog is deactivated in Stop Mode</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
