Infineon/SBC-for-Arduino/LiteSBC Microcontroller Library/com.ifx.tb.legacy.configwizard_2.1.30.201902131318/application/scripts/ICW_TLE9263/TLE9263.svd
				<register>
					<name>WK_CTRL_2</name>
					<description>External Wake Source Control</description>
					<addressOffset>7</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>INT_GLOBAL</name>
							<description>Global Interrupt Configuration (see also )</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>wake_only</name>
									<description>Only wake sources trigger INTN (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>all_status_bits</name>
									<description>All status information register bits will trigger INTN (including all wake sources)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WK_MEAS</name>
							<description>Wake / Voltage Sensing Selection (see also )</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>wake</name>
									<description>Wake functionality enabled for WK</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>voltage_sensing</name>
									<description>Voltage sensing functionality enabled, no wake-up events are generated</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WK3_EN</name>
							<description>WK3 Wake Source Control</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>WK3 wake disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>WK3 is enabled as a wake source</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WK2_EN</name>
							<description>WK2 Wake Source Control</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>WK2 wake disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>WK2 is enabled as a wake source</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WK1_EN</name>
							<description>WK1 Wake Source Control</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>WK1 wake disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>WK1 is enabled as a wake source</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WK_PUPD_CTRL</name>
					<description>Wake Input Level Control</description>
					<addressOffset>8</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>WK3_PUPD</name>
							<description>WK3 Pull-Up / Pull-Down Configuration</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>none</name>
									<description>No pull-up / pull-down selected</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pull-down</name>
									<description>Pull-down resistor selected</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pull-up</name>
									<description>Pull-up resistor selected</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>automatic</name>
									<description>Automatic switching to pull-up or pull-down</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WK2_PUPD</name>
							<description>WK2 Pull-Up / Pull-Down Configuration</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>none</name>
									<description>No pull-up / pull-down selected</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pull-down</name>
									<description>Pull-down resistor selected</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pull-up</name>
									<description>Pull-up resistor selected</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>automatic</name>
									<description>Automatic switching to pull-up or pull-down</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WK1_PUPD</name>
							<description>WK1 Pull-Up / Pull-Down Configuration</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>none</name>
									<description>No pull-up / pull-down selected</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pull-down</name>
									<description>Pull-down resistor selected</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pull-up</name>
									<description>Pull-up resistor selected</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>automatic</name>
									<description>Automatic switching to pull-up or pull-down</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WK_FLT_CTRL</name>
					<description>Wake Input Filter Time Control</description>
					<addressOffset>9</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>WK3_FLT</name>
							<description>WK3 Filter Time Configuration</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>16us</name>
									<description>Configuration A: Filter with 16μs filter time (static sensing)</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>64us</name>
									<description>Configuration B: Filter with 64μs filter time (static sensing)</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16us_Timer1</name>
									<description>Configuration C: Filtering at the end of the on-time; a filter time of 16μs (cyclic sensing) is selected, Timer1</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16us_Timer2</name>
									<description>Configuration D: Filtering at the end of the on-time; a filter time of 16μs (cyclic sensing) is selected, Timer2</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WK2_FLT</name>
							<description>WK2 Filter Time Configuration</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>16us</name>
									<description>Configuration A: Filter with 16μs filter time (static sensing)</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>64us</name>
									<description>Configuration B: Filter with 64μs filter time (static sensing)</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16us_Timer1</name>
									<description>Configuration C: Filtering at the end of the on-time; a filter time of 16μs (cyclic sensing) is selected, Timer1</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16us_Timer2</name>
									<description>Configuration D: Filtering at the end of the on-time; a filter time of 16μs (cyclic sensing) is selected, Timer2</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WK1_FLT</name>
							<description>WK2 Filter Time Configuration</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>16us</name>
									<description>Configuration A: Filter with 16μs filter time (static sensing)</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>64us</name>
									<description>Configuration B: Filter with 64μs filter time (static sensing)</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16us_Timer1</name>
									<description>Configuration C: Filtering at the end of the on-time; a filter time of 16μs (cyclic sensing) is selected, Timer1</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16us_Timer2</name>
									<description>Configuration D: Filtering at the end of the on-time; a filter time of 16μs (cyclic sensing) is selected, Timer2</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMER1_CTRL</name>
					<description>Timer1 Control and Selection</description>
					<addressOffset>12</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>TIMER1_ON</name>
							<description>Timer1 On-Time Configuration</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>off_(low)</name>
									<description>OFF / Low (timer not running, HSx output is low)</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0.1ms</name>
									<description>0.1ms on-time</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0.3ms</name>
									<description>0.3ms on-time</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1.0ms</name>
									<description>1.0ms on-time</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10ms</name>
									<description>10ms on-time</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>20ms</name>
									<description>20ms on-time</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>off_(high)</name>
									<description>OFF / HIGH (timer not running, HSx output is high)</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reserved</name>
									<description>reserved OFF / HIGH (timer not running, HSx output is high)</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIMER1_PER</name>
							<description>Timer1 Period Configuration</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10ms</name>
									<description>10ms</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>20ms</name>
									<description>20ms</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>50ms</name>
									<description>50ms</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>100ms</name>
									<description>100ms</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>200ms</name>
									<description>200ms</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1s</name>
									<description>1s</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2s</name>
									<description>2s</description>
									<value>0b110</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMER2_CTRL</name>
					<description>Timer2 Control and Selection</description>
					<addressOffset>13</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>TIMER2_ON</name>
							<description>Timer2 On-Time Configuration</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>off_(low)</name>
									<description>OFF / Low (timer not running, HSx output is low)</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0.1ms</name>
									<description>0.1ms on-time</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0.3ms</name>
									<description>0.3ms on-time</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1.0ms</name>
									<description>1.0ms on-time</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10ms</name>
									<description>10ms on-time</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>20ms</name>
									<description>20ms on-time</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>off_(high)</name>
									<description>OFF / HIGH (timer not running, HSx output is high)</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reserved</name>
									<description>reserved OFF / HIGH (timer not running, HSx output is high)</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIMER2_PER</name>
							<description>Timer2 Period Configuration</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10ms</name>
									<description>10ms</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>20ms</name>
									<description>20ms</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>50ms</name>
									<description>50ms</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>100ms</name>
									<description>100ms</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>200ms</name>
									<description>200ms</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1s</name>
									<description>1s</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2s</name>
									<description>2s</description>
									<value>0b110</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SW_SD_CTRL</name>
					<description>Switch Shutdown Control</description>
					<addressOffset>16</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>HS_OV_SD_EN</name>
							<description>Shutdown Disabling of HS1...4 in case of VSHS OV</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>shutdown_enabled</name>
									<description>shutdown enabled in case of VSHS OV</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>shutdown_disabled</name>
									<description>shutdown disabled in case of VSHS OV</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS_UV_SD_EN</name>
							<description>Shutdown Disabling of HS1...4 in case of VSHS UV</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>shutdown_enabled</name>
									<description>shutdown enabled in case of VSHS UV</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>shutdown_disabled</name>
									<description>shutdown disabled in case of VSHS UV</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS_OV_UV_REC</name>
							<description>Switch Recovery after Removal of VSHS OV/UV for HS1...4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Switch_recovery_disabled</name>
									<description>Switch recovery is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Previous_state_enabled</name>
									<description>Previous state before VSHS OV/UV is enabled after OV/UV condition is removed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HS_CTRL_1</name>
					<description>High-Side Switch Control 1</description>
					<addressOffset>20</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>HS2</name>
							<description>HS2 Configuration</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Off</name>
									<description>Off</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>On</name>
									<description>On</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Controlled_by_Timer1</name>
									<description>Controlled by Timer1</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Controlled_by_Timer2</name>
									<description>Controlled by Timer2</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Controlled_by_PWM1</name>
									<description>Controlled by PWM1</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Controlled_by_PWM2</name>
									<description>Controlled by PWM2</description>
									<value>0b101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1</name>
							<description>HS1 Configuration</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Off</name>
									<description>Off</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>On</name>
									<description>On</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Controlled_by_Timer1</name>
									<description>Controlled by Timer1</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Controlled_by_Timer2</name>
									<description>Controlled by Timer2</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Controlled_by_PWM1</name>
									<description>Controlled by PWM1</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Controlled_by_PWM2</name>
									<description>Controlled by PWM2</description>
									<value>0b101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
