Infineon/SBC-for-Arduino/LiteSBC Microcontroller Library/com.ifx.tb.legacy.configwizard_2.1.30.201902131318/application/scripts/ICW_TLE9263/TLE9263.svd
				<register>
					<name>HS_CTRL_2</name>
					<description>High-Side Switch Control 2</description>
					<addressOffset>21</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>HS4</name>
							<description>HS4 Configuration</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Off</name>
									<description>Off</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>On</name>
									<description>On</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Controlled_by_Timer1</name>
									<description>Controlled by Timer1</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Controlled_by_Timer2</name>
									<description>Controlled by Timer2</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Controlled_by_PWM1</name>
									<description>Controlled by PWM1</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Controlled_by_PWM2</name>
									<description>Controlled by PWM2</description>
									<value>0b101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS3</name>
							<description>HS3 Configuration</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Off</name>
									<description>Off</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>On</name>
									<description>On</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Controlled_by_Timer1</name>
									<description>Controlled by Timer1</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Controlled_by_Timer2</name>
									<description>Controlled by Timer2</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Controlled_by_PWM1</name>
									<description>Controlled by PWM1</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Controlled_by_PWM2</name>
									<description>Controlled by PWM2</description>
									<value>0b101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIO_CTRL</name>
					<description>GPIO Configuration Control</description>
					<addressOffset>23</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>FO_DC</name>
							<description>Duty Cycle Configuration of FO3 (if selected)</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>20%</name>
									<description>20%</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10%</name>
									<description>10%</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5%</name>
									<description>5%</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2.5%</name>
									<description>2.5%</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO2</name>
							<description>GPIO2 Configuration</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>FO3</name>
									<description>FO3 selected</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FO3</name>
									<description>FO3 selected</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FO3</name>
									<description>FO3 selected</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FO3</name>
									<description>FO3 selected</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OFF</name>
									<description>OFF</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Wake_input</name>
									<description>Wake input enabled (16us static filter)</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Low-Side_PWM</name>
									<description>Low-Side Switch ON</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>High-Side_PWM</name>
									<description>High-Side Switch ON</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1</name>
							<description>GPIO1 Configuration</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>FO2</name>
									<description>FO2 selected</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FO2</name>
									<description>FO2 selected</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FO2</name>
									<description>FO2 selected</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FO2</name>
									<description>FO2 selected</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OFF</name>
									<description>OFF</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Wake_input</name>
									<description>Wake input enabled (16us static filter)</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Low-Side_PWM</name>
									<description>Low-Side Switch ON</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>High-Side_PWM</name>
									<description>High-Side Switch ON</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM1_CTRL</name>
					<description>PWM1 Configuration Control</description>
					<addressOffset>24</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>PWM1_DC</name>
							<description>PWM1 Duty Cycle (bit0=LSB; bit7=MSB)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM2_CTRL</name>
					<description>PWM2 Configuration Control</description>
					<addressOffset>25</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>PWM2_DC</name>
							<description>PWM2 Duty Cycle (bit0=LSB; bit7=MSB)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM_FREQ_CTRL</name>
					<description>PWM Frequency Configuration Control</description>
					<addressOffset>28</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>PWM2_FREQ</name>
							<description>PWM2 Frequency Selection</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>200Hz</name>
									<description>200Hz configuration</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400Hz</name>
									<description>400Hz configuration</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWM1_FREQ</name>
							<description>PWM1 Frequency Selection</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>200Hz</name>
									<description>200Hz configuration</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400Hz</name>
									<description>400Hz configuration</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYS_STATUS_CTRL</name>
					<description>System Status Control</description>
					<addressOffset>30</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>SYS_STAT</name>
							<description>System Status Control Byte (bit0=LSB; bit7=MSB)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_CTRL</name>
					<description>CAN Selective Wake Control</description>
					<addressOffset>32</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>OSC_CAL</name>
							<description>Oscillator Calibration Mode</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>Oscillator Calibration is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Oscillator Calibration is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRIM_EN</name>
							<description>(Un)locking mechanism of oscillator recalibration</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>locked_0</name>
									<description>locked</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>locked_1</name>
									<description>locked</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>locked_2</name>
									<description>locked</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>unlocked</name>
									<description>unlocked</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CANTO_MASK</name>
							<description>CAN Time Out Masking</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_INTN</name>
									<description>CAN time-out is masked - no interrupt (on pin INTN) is triggered</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTN</name>
									<description>CAN time-out is signaled on INTN</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CFG_VAL</name>
							<description>SWK Configuration valid</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_valid</name>
									<description>Configuration is not valid (SWK not possible)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>valid</name>
									<description>SWK configuration valid, needs to be set to enable SWK</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_BTL0_CTRL</name>
					<description>SWK Bit Timing Logic Control1</description>
					<addressOffset>33</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>TBIT</name>
							<description>Number of Time Quanta in a Bit Time</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_BTL1_CTRL</name>
					<description>SWK Bit Timing Control2</description>
					<addressOffset>34</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>SP</name>
							<description>Sampling Point Position</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_ID3_CTRL</name>
					<description>SWK WUF Identifier bits 28...21</description>
					<addressOffset>35</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>ID28_21</name>
							<description>WUF Identifier Bits 28...21</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_ID2_CTRL</name>
					<description>SWK WUF Identifier bits 20...13</description>
					<addressOffset>36</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>ID20_13</name>
							<description>WUF Identifier Bits 20...13</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_ID1_CTRL</name>
					<description>SWK WUF Identifier bits 12...5</description>
					<addressOffset>37</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>ID12_5</name>
							<description>WUF Identifier Bits 12...5</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_ID0_CTRL</name>
					<description>SWK WUF Identifier bits 4...0</description>
					<addressOffset>38</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>ID4_0</name>
							<description>WUF Identifier Bits 4..0</description>
							<lsb>2</lsb>
							<msb>6</msb>
							<access>read-write</access>							
							<enumeratedValues>
							</enumeratedValues>
						</field>
						<field>
							<name>RTR</name>
							<description>Remote Transmission Request Field (acc. ISO 11898-1)</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>Normal Data Frame</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Remote Transmission Request</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDE</name>
							<description>Identifier Extension Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>11bit</name>
									<description>Standard Identifier Length (11 bit)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>29bit</name>
									<description>Extended Identifier Length (29 bit)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_MASK_ID3_CTRL</name>
					<description>SWK WUF Identifier Mask bits 28...21</description>
					<addressOffset>39</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>MASK_ID28_21</name>
							<description>WUF Identifier Mask Bits 28...21</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ignored</name>
									<description>Unmasked - bit is ignored</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Masked - bit is compared in CAN frame</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_MASK_ID2_CTRL</name>
					<description>SWK WUF Identifier Mask bits 20...13</description>
					<addressOffset>40</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>MASK_ID20_13</name>
							<description>WUF Identifier Mask Bits 20...13</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ignored</name>
									<description>Unmasked - bit is ignored</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Masked - bit is compared in CAN frame</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_MASK_ID1_CTRL</name>
					<description>SWK WUF Identifier Mask bits 12...5</description>
					<addressOffset>41</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>MASK_ID12_5</name>
							<description>WUF Identifier Mask Bits 12...5</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ignored</name>
									<description>Unmasked - bit is ignored</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Masked - bit is compared in CAN frame</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_MASK_ID0_CTRL</name>
					<description>SWK WUF Identifier bits 4...0</description>
					<addressOffset>42</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>MASK_ID4_0</name>
							<description>WUF Identifier MASK Bits 4..0</description>
							<lsb>2</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>irgnored</name>
									<description>Unmasked - bit is ignored</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Masked - bit is compared in CAN frame</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_DLC_CTRL</name>
					<description>SWK Frame Data Length Code Control</description>
					<addressOffset>43</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>DLC</name>
							<description>Payload length in number of bytes</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Frame Data Length = 0 or cleared</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Frame Data Length = 1</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>Frame Data Length = 2</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3</name>
									<description>Frame Data Length = 3</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>Frame Data Length = 4</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5</name>
									<description>Frame Data Length = 5</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6</name>
									<description>Frame Data Length = 6</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7</name>
									<description>Frame Data Length = 7</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8</name>
									<description>Frame Data Length = 8</description>
									<value>0b1000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_DATA7_CTRL</name>
					<description>SWK Data7 Register</description>
					<addressOffset>44</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>DATA7</name>
							<description>Data7 byte content(bit0=LSB; bit7=MSB)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_DATA6_CTRL</name>
					<description>SWK Data6 Register</description>
					<addressOffset>45</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>DATA6</name>
							<description>Data6 byte content (bit0=LSB; bit7=MSB)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_DATA5_CTRL</name>
					<description>SWK Data5 Register</description>
					<addressOffset>46</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>DATA5</name>
							<description>Data5 byte content (bit0=LSB; bit7=MSB)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_DATA4_CTRL</name>
					<description>SWK Data4 Register</description>
					<addressOffset>47</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>DATA4</name>
							<description>Data4 byte content (bit0=LSB; bit7=MSB)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
